<p>&nbsp;</p>
<p style="text-align: justify;"><video controls="controls" width="300" height="150">
<source src="https://www.facebook.com/watch/?v=3302579950061290" /></video>Has Ganado!!!, Felicidades.</p>
<p><a href="https://www.facebook.com/100063805243862/videos/3302579950061290">https://www.facebook.com/100063805243862/videos/3302579950061290</a></p>
<p style="text-align: justify;">Buscaminas (nombre original en ingl&eacute;s: Minesweeper) es un videojuego para un jugador creado <br />por Curt Jhonson y Robert Donner en 1989. El objetivo del juego es despejar un campo de minas <br />sin detonar ninguna. El juego consiste en descubrir todas las ubicaciones de un tablero <br />cuadriculado en las que hay minas. El juego empieza con todo el tablero cubierto y para empezar <br />a jugar tendremos que pulsar en cualquier casilla, lo cual nos mostrar&aacute; su contenido, el cual puede <br />ser: una mina, en cuyo caso perderemos la partida; un n&uacute;mero, que indicar&aacute; la cantidad de minas <br />en las 8 casillas adyacentes; o puede aparecer como una casilla en blanco, lo cual indica que no <br />tiene ninguna mina en las casillas que est&aacute;n a su alrededor. Cuando pulsamos en una casilla sin <br />minas en ocasiones se nos abrir&aacute;n las casillas de alrededor que no tengan minas en sus respectivas <br />casillas adyacentes hasta que el espacio abierto est&eacute; rodeado o bien de los l&iacute;mites del mapa o de <br />casillas con minas en sus alrededores, aunque esto no quiere decir que haya casillas m&aacute;s all&aacute; de <br />las que se han mostrado sin minas ya que solo se mostrar&aacute;n las casillas con minas adyacentes que <br />tengan una casilla sin n&uacute;mero en sus casillas cercanas. Conociendo la cantidad de minas en las <br />casillas adyacentes de varias posiciones al mismo tiempo se puede ir deduciendo el <br />emplazamiento de las minas, las cuales deberemos ir marcando hasta haber se&ntilde;alado el n&uacute;mero <br />de minas escondidas inicialmente, una vez hecho esto si hemos acertado con las casillas marcadas <br />habremos ganado la partida.<br />El juego se puede configurar para jugar en diferentes dificultades ya predise&ntilde;adas o se puede <br />personalizar manualmente el tama&ntilde;o del tablero y la cantidad de minas que queremos que se <br />escondan en &eacute;l, ajustando as&iacute; la dificultad al gusto de cada jugador. Independientemente de los <br />ajustes, cada partida ser&aacute; &uacute;nica ya que las minas se ponen en el tablero de forma aleatoria en <br />cada ocasi&oacute;n.<br />&iquest;Para qu&eacute; sirve el Buscaminas?<br />El buscaminas fue uno de los primeros juegos que se implementaron en ordenadores <br />personales modernos, junto con otros juegos como el Solitario o los Corazones, todos estos no <br />se crearon buscando entretener a los usuarios, por el contrario, persegu&iacute;an que la gente se <br />habituara a usar el rat&oacute;n, haciendo que en estos juegos necesitaras pulsar en cuadrados <br />peque&ntilde;os con precisi&oacute;n como en el caso del buscaminas o pulsar y arrastrar las cartas como en <br />el caso del solitario. Estos juegos con los a&ntilde;os han seguido formando parte de los sistemas <br />operativos de Microsoft de forma nativa, sufriendo actualizaciones y cambios en la interfaz hasta <br />Windows 8, que es la &uacute;ltima versi&oacute;n de Windows que los inclu&iacute;a.<br />El buscaminas cl&aacute;sico usa una cuadricula de distintas dimensiones, pero con los a&ntilde;os han ido <br />apareciendo otras versiones que llevan el concepto m&aacute;s all&aacute; introduciendo tableros triangulares <br />o con otras formas geom&eacute;tricas adem&aacute;s de nuevas mec&aacute;nicas como la posibilidad de jugar en <br />tres dimensiones o que puedan aparecer varias minas en la misma casilla.<br />Neur&oacute;logos brit&aacute;nicos realizaron un estudio entre los que juegan y los que no juegan. Los <br />resultados sorprendieron al p&uacute;blico. Result&oacute; que las personas que juegan al buscaminas aprenden <br />habilidades motoras mucho m&aacute;s r&aacute;pido y su cerebro absorbe nueva informaci&oacute;n m&aacute;s r&aacute;pido. <br />Bonificaci&oacute;n: mejora la percepci&oacute;n de los jugadores de los peque&ntilde;os componentes del todo.<br />La serie de juegos Buscaminas en l&iacute;nea merece atenci&oacute;n. A pesar del nombre militante, el juego <br />en l&iacute;nea Buscaminas es bastante pac&iacute;fico. El juego est&aacute; incluido en el conjunto de juguetes <br />gratuitos para todas las ventanas. &iexcl;Una trama simple no requiere un estudio profundo de las reglas! <br />Pero el juego requiere atenci&oacute;n e ingenio por parte de los jugadores. Un movimiento falso resultar&aacute; <br />en una explosi&oacute;n. Un paso en falso hacia la explosi&oacute;n y la p&eacute;rdida. Tendremos que empezar de <br />nuevo. El juego Buscaminas es tan atractivo que puede cautivarte f&aacute;cilmente durante varias horas.<br />Hay que tener en cuenta que puedes perder desde el primer movimiento. Si aterrizas <br />accidentalmente en una mina detr&aacute;s de cuadrados ocultos, tendr&aacute;s que empezar de nuevo. No se <br />moleste, pero la mano misma dirige el mouse de la computadora para reiniciar el proceso.<br />Buscaminas es adecuado para ni&ntilde;os y adultos. No cabe duda que este minijuego tiene beneficios, <br />los cuales son los siguientes:<br />&bull; Mejora el cerebro;<br />&bull; Desarrolla el pensamiento;<br />&bull; Desarrolla la capacidad de responder con eficacia;<br />&bull; Desarrolla habilidades motoras en un ni&ntilde;o de 3 a 9 a&ntilde;os.<br />&bull; Ayuda al cerebro a mantenerse en forma</p>